Autodesk.Revit.DB.Plumbing.FluidType.AddTemperature(Autodesk.Revit.DB.Plumbing.FluidTemperature)
Adds a fluid temperature to the set.
fluidTemperature:
The fluid temperature being inserted.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown if the temperature that will be added already exists in the fluid type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Plumbing.FluidType.IsFluidInUse(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Identifies if the fluid type is in use.
Remarks:
If a fluid type is in use, it cannot be deleted.
document:
The document.
fluidId:
The id of the fluid type.
Returns:
True if the fluid type is in use.
False if the fluid type is not in use.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Plumbing.FluidType.GetFluidType(Autodesk.Revit.DB.Document,System.String)
Gets a fluid type by name.
document:
The document.
fluidTypeName:
The name of fluid type.
Returns:
The fluid type. null if the fluid type was not found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Plumbing.FluidType.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.Plumbing.FluidType)
Creates a new fluid type and adds it to the document.
Remarks:
The new fluid type will be a duplicate of the input type.
document:
The document.
fluidTypeName:
The name of new created fluid type.
basedOnFluidType:
The existing fluid type which is based on.
Returns:
The newly created fluid type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Plumbing.FluidType.Create(Autodesk.Revit.DB.Document,System.String)
Creates a new empty fluid type and adds it to the document.
document:
The document.
fluidTypeName:
The name of fluid type.
Returns:
The newly created fluid type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013